Revit 2027 API
BuiltInFailures.SiteFailures.SiteEditPointsClipped Property
 Portions of the topographic surface or points on the surface may not be visible in this view due to clipping by the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SiteEditPointsClipped { get; }
Public Shared ReadOnly Property SiteEditPointsClipped As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SiteEditPointsClipped {
	FailureDefinitionId^ get ();
}
static member SiteEditPointsClipped : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SiteFailures Class
Autodesk.Revit.DB Namespace